"""
Для экспериментов с запросами мы создали копию сайта wttr, на нём можно бесстрашно проводить всевозможные опыты.
Пора учить Анфису разговаривать с серверами. Браузер ей не нужен: она же программа! Значит, она будет пользоваться программным клиентом.
wttr.in — это сайт с прогнозом погоды, удобный для разработчиков. Если набрать адрес этого сайта без параметров, то получим прогноз погоды на несколько дней (попробуйте сделать это в браузере).
Чтобы вывод был компактным и отображался в тренажёре, задаём следующие параметры:
0 - погода только на текущий момент
T - только текст, чёрно-белый
Откройте в браузере новый URL с параметрами: страницу http://wttr.in/?0T. Посмотрите, что получается.
Затем сделайте аналогичный HTTP-запрос на чистом Python.

"""

import requests

url = 'http://wttr.in/?0T'
response_1 = requests.get('https://wttr.in/')
response_2 = requests.get('https://wttr.in/?0T')  # выполните HTTP-запрос

print(response_1.text)  # напечатайте текст HTTP-ответа
print(response_2.text)  # напечатайте текст HTTP-ответа