# Словарь, в котором хранятся начертания букв и их названия:
old_letters = {
    'ять': 'Ѣ',
    'юс малый': 'Ѧ',
    'юс большой': 'Ѫ'}

print(old_letters.values())
# Будет напечатан список значений словаря:
# dict_values(['Ѣ', 'Ѧ', 'Ѫ'])


favorite_songs = {
    'Тополиный пух': 'Иванушки international',
    'Город золотой': 'Аквариум',
    'Звезда по имени Солнце': 'Кино'
}

print(favorite_songs.keys())
# Будет напечатан список ключей словаря:
# dict_keys(['Тополиный пух', 'Город золотой', 'Звезда по имени Солнце'])

"""
Метод values() возвращает коллекцию типа dict_values(), а метод keys() — коллекцию типа dict_keys(). 
Эти коллекции похожи на списки; их можно преобразовать в списки или в множества — и работать с ними.
"""

english = {
    'рука': 'hand',
    'нога': 'leg',
    'хвост': 'tail',
    'питон': 'python',
    'бэкенд-разработчик': 'backend developer'
}
# Собираем ключи словаря в коллекцию
# и преобразуем эту коллекцию в список:
words_ru = list(english.keys())

# Собираем значения словаря в коллекцию
# и преобразуем эту коллекцию в список:
words_en = list(english.values())

# Печатаем списки:
print(words_ru)

print(words_en)